---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.MarbleSize
source: html/c7a2581c-ee4c-58da-702e-d8eb6756d7b0.htm
---
# Autodesk.Revit.DB.Visual.Marble.MarbleSize Property

The property labeled "Vein Spacing" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string MarbleSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".